<a href="https://colab.research.google.com/github/VijayarajanS/ineuron-assignment/blob/master/Data_cleaning_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd 
import numpy as np

In [0]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [38]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [41]:
df['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [45]:
#1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place.
# Fill in these missing numbers and make the column an integer column (instead of a float column). 

for i in range(0,len(df)):
  if(pd.isnull(df.loc[i,'FlightNumber'])):
    df.loc[i,'FlightNumber'] = df.loc[i-1,'FlightNumber'] +10

df['FlightNumber'] = df['FlightNumber'].astype(int)

print("After the filling the NaN value in FlightNumber column and changing the data type to int: \n")
print(df)

After the filling the NaN value in FlightNumber column and changing the data type to int:

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [46]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [55]:
df['From_To'].str.split('_')

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: From_To, dtype: object

In [70]:
temporary_df = df.copy()

temporary_df[['From','To']]= temporary_df['From_To'].str.split('_',expand=True)

temporary_df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [73]:
#3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. 
#Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".) 

temporary_df['From_To'] = temporary_df.From_To.str.capitalize()
temporary_df['From'] = temporary_df.From_To.str.capitalize()
temporary_df['To'] = temporary_df.From_To.str.capitalize()
temporary_df

            From_To  FlightNumber  ...              From                To
0      London_paris         10045  ...      London_paris      London_paris
1      Madrid_milan         10055  ...      Madrid_milan      Madrid_milan
2  London_stockholm         10065  ...  London_stockholm  London_stockholm
3    Budapest_paris         10075  ...    Budapest_paris    Budapest_paris
4   Brussels_london         10085  ...   Brussels_london   Brussels_london

[5 rows x 6 columns]

In [88]:
#4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions. 

df.drop('From_To',axis=1,inplace=True)

df['From_To'] = temporary_df['From_To']

col_name = ['From_To','FlightNumber','RecentDelays','Airline']
df=df.reindex(columns=col_name)
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris         10045      [23, 47]               KLM(!)
1      Madrid_milan         10055            []    <Air France> (12)
2  London_stockholm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_paris         10075          [13]       12. Air France
4   Brussels_london         10085      [67, 32]          "Swiss Air"

In [105]:
#5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each 
#second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. 
#Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and 
#replace the unwanted RecentDelays column in df with delays


temp1 = pd.DataFrame(df.RecentDelays.values.tolist())
column_name = ['Delay1','Delay2','Delay3']
temp1.columns = column_name
temp1

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [0]:
df = df.join(temp1)

In [0]:
df.drop('RecentDelays',axis=1,inplace=True)

In [112]:
#Final output
df

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0      London_paris         10045               KLM(!)    23.0    47.0     NaN
1      Madrid_milan         10055    <Air France> (12)     NaN     NaN     NaN
2  London_stockholm         10065  (British Airways. )    24.0    43.0    87.0
3    Budapest_paris         10075       12. Air France    13.0     NaN     NaN
4   Brussels_london         10085          "Swiss Air"    67.0    32.0     NaN